app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "comment1"], ["body", "body1"], ["post_id", 1], ["created_at", "2018-06-29 03:18:46.780459"], ["updated_at", "2018-06-29 03:18:46.780459"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create( comment_params  )