app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Post 2"], ["title", "Title 2"], ["content", "Content 2"], ["created_at", "2018-06-29 03:19:22.339422"], ["updated_at", "2018-06-29 03:19:22.339422"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "name" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["name", "John"], ["updated_at", "2018-06-27 10:22:59.980463"], ["id", 1]]